package com.atguigu.java;

/*
*   Java 面向对象学习的三条主线:(第4-6章)
*   1 Java类及类的成员: 属性 方法 构造器;  代码块 内部类
*   2 面向对象的三大特征: 封装性 继承性 多态性 (抽象性)
*   3 其他关键字: this super static final abstract interface package import 等
*
*
*   面向过程与面向对象: 二者都是一种思想, 面向对象是相对于面向过程而言的. 面向过程, 强调的是功能行为, 以函数为最小单位,
*   考虑怎么做. 面向对象, 将功能封装进对象中,强调具备了功能的对象, 以类/对象为最小单位, 考虑谁来做
*
*   面向对象更加强调运用人类在日常的思维逻辑中采用的思想方法与原则, 如抽象 分类 继承 聚合 多态等
*
*   面向对象的三大特征: 封装 继承 多态
*
*   面向对象的两个要素: 类 对象(实例)
*   类:对一类事物的描述, 是抽象上 概念上的定义
*   对象: 是实际存在的该类事物的每个个体, 因而也称为实例(instance)
*
*   面向对象程序设计的重点是类的设计
*   设计类 就是设计类的成员
* */
public class OOPTest {
}
